bench/report/statistics.json
{
  "GET shop" : {
    "transaction" : "GET shop",
    "sampleCount" : 114353,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.819383837765553,
    "medianResTime" : 9.0,
    "minResTime" : 0.0,
    "maxResTime" : 79.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 24.0,
    "throughput" : 3815.8368926855314,
    "receivedKBytesPerSec" : 913.0922593474706,
    "sentKBytesPerSec" : 696.4420903130006
  },
  "POST seckill" : {
    "transaction" : "POST seckill",
    "sampleCount" : 28816,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.311146585230397,
    "medianResTime" : 18.0,
    "minResTime" : 5.0,
    "maxResTime" : 94.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 31.0,
    "pct3ResTime" : 43.0,
    "throughput" : 962.2975455000835,
    "receivedKBytesPerSec" : 234.93592419435632,
    "sentKBytesPerSec" : 268.30442399607614
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 143169,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.931088433948702,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 94.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 34.0,
    "throughput" : 4776.439580970174,
    "receivedKBytesPerSec" : 1147.6181049618003,
    "sentKBytesPerSec" : 964.347519152015
  }
}